apache/nuttx/arch/arm/src/imxrt/imxrt_serial.c
#if !defined(CONFIG_LPUART12_TXDMA)
#  define LPUART12_TXBUFSIZE_ADJUSTED  CONFIG_LPUART12_TXBUFSIZE
#  define LPUART12_TXBUFSIZE_ALGN
#else
#  define LPUART12_TXBUFSIZE_ADJUSTED TXDMA_BUF_SIZE(CONFIG_LPUART12_TXBUFSIZE)
#  define LPUART12_TXBUFSIZE_ALGN TXDMA_BUF_ALIGN
#endif

/* Which LPUART with be tty0/console and which tty1-7?  The console will
 * always be ttyS0.  If there is no console then will use the lowest
 * numbered UART.
 */

/* First pick the console and ttys0.  This could be any of LPUART1-8 */

#if defined(CONFIG_LPUART1_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart1priv /* LPUART1 is console */
#  define TTYS0_DEV           g_lpuart1priv /* LPUART1 is ttyS0 */
#  define LPUART1_ASSIGNED    1
#  if defined(CONFIG_LPUART1_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART1_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART2_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart2priv /* LPUART2 is console */
#  define TTYS0_DEV           g_lpuart2priv /* LPUART2 is ttyS0 */
#  define LPUART2_ASSIGNED    1
#  if defined(CONFIG_LPUART2_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART2_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART3_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart3priv /* LPUART3 is console */
#  define TTYS0_DEV           g_lpuart3priv /* LPUART3 is ttyS0 */
#  define LPUART3_ASSIGNED    1
#  if defined(CONFIG_LPUART3_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART3_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART4_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart4priv /* LPUART4 is console */
#  define TTYS0_DEV           g_lpuart4priv /* LPUART4 is ttyS0 */
#  define LPUART4_ASSIGNED    1
#  if defined(CONFIG_LPUART4_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART4_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART5_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart5priv /* LPUART5 is console */
#  define TTYS0_DEV           g_lpuart5priv /* LPUART5 is ttyS0 */
#  define LPUART5_ASSIGNED    1
#  if defined(CONFIG_LPUART5_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART5_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART6_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart6priv /* LPUART6 is console */
#  define TTYS0_DEV           g_lpuart6priv /* LPUART6 is ttyS0 */
#  define LPUART6_ASSIGNED    1
#  if defined(CONFIG_LPUART6_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART6_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART7_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart7priv /* LPUART7 is console */
#  define TTYS0_DEV           g_lpuart7priv /* LPUART7 is ttyS0 */
#  define LPUART7_ASSIGNED    1
#  if defined(CONFIG_LPUART7_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART7_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART8_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart8priv /* LPUART8 is console */
#  define TTYS0_DEV           g_lpuart8priv /* LPUART8 is ttyS0 */
#  define LPUART8_ASSIGNED    1
#  if defined(CONFIG_LPUART8_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART9_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART9_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart9priv /* LPUART9 is console */
#  define TTYS0_DEV           g_lpuart9priv /* LPUART9 is ttyS0 */
#  define LPUART9_ASSIGNED    1
#  if defined(CONFIG_LPUART9_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART9_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART10_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart10priv /* LPUART10 is console */
#  define TTYS0_DEV           g_lpuart10priv /* LPUART10 is ttyS0 */
#  define LPUART10_ASSIGNED   1
#  if defined(CONFIG_LPUART10_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART10_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART11_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart11priv /* LPUART11 is console */
#  define TTYS0_DEV           g_lpuart11priv /* LPUART11 is ttyS0 */
#  define LPUART11_ASSIGNED   1
#  if defined(CONFIG_LPUART11_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART11_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART12_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart12priv /* LPUART12 is console */
#  define TTYS0_DEV           g_lpuart12priv /* LPUART12 is ttyS0 */
#  define LPUART12_ASSIGNED   1
#  if defined(CONFIG_LPUART12_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART12_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#else
#  undef CONSOLE_DEV                      /* No console */
#endif

#if defined(SERIAL_HAVE_CONSOLE_RXDMA) || defined(SERIAL_HAVE_CONSOLE_TXDMA)
#  define SERIAL_HAVE_CONSOLE_DMA
#endif

/* Pick ttys0 or ttys1.  This could be any of UART1-12. */

#if defined(CONFIG_IMXRT_LPUART1) && !defined(LPUART1_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart1priv /* LPUART1 is ttyS1 */
#    define LPUART1_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart1priv
#    define LPUART1_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART2) && !defined(LPUART2_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart2priv /* LPUART2 is ttyS1 */
#    define LPUART2_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart2priv
#    define LPUART2_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART3) && !defined(LPUART3_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart3priv /* LPUART3 is ttyS1 */
#    define LPUART3_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart3priv
#    define LPUART3_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART4) && !defined(LPUART4_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart4priv /* LPUART4 is ttyS1 */
#    define LPUART4_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart4priv
#    define LPUART4_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART5) && !defined(LPUART5_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart5priv /* LPUART5 is ttyS1 */
#    define LPUART5_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart5priv
#    define LPUART5_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart6priv /* LPUART6 is ttyS1 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart7priv /* LPUART7 is ttyS1 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart8priv /* LPUART8 is ttyS1 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart9priv /* LPUART9 is ttyS1 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart10priv /* LPUART10 is ttyS1 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart11priv /* LPUART11 is ttyS1 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart12priv /* LPUART12 is ttyS1 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS0_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

