apache/nuttx/arch/arm/src/imxrt/imxrt_serial.c
/* Pick ttys1/ttys2.  This could be one of UART2-12. */

#if defined(CONFIG_IMXRT_LPUART2) && !defined(LPUART2_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart2priv /* LPUART2 is ttyS2 */
#    define LPUART2_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart2priv
#    define LPUART2_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART3) && !defined(LPUART3_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart3priv /* LPUART3 is ttyS2 */
#    define LPUART3_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart3priv
#    define LPUART3_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART4) && !defined(LPUART4_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart4priv /* LPUART4 is ttyS2 */
#    define LPUART4_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart4priv
#    define LPUART4_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART5) && !defined(LPUART5_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart5priv /* LPUART5 is ttyS2 */
#    define LPUART5_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart5priv
#    define LPUART5_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart6priv /* LPUART6 is ttyS2 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart7priv /* LPUART7 is ttyS2 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart8priv /* LPUART8 is ttyS2 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart9priv /* LPUART9 is ttyS2 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart10priv /* LPUART10 is ttyS2 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart11priv /* LPUART11 is ttyS2 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart12priv /* LPUART12 is ttyS2 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS1_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys2/ttys3. This could be one of UART3-12. */

#if defined(CONFIG_IMXRT_LPUART3) && !defined(LPUART3_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart3priv /* LPUART3 is ttyS3 */
#    define LPUART3_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart3priv
#    define LPUART3_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART4) && !defined(LPUART4_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart4priv /* LPUART4 is ttyS3 */
#    define LPUART4_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart4priv
#    define LPUART4_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART5) && !defined(LPUART5_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart5priv /* LPUART5 is ttyS3 */
#    define LPUART5_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart5priv
#    define LPUART5_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart6priv /* LPUART6 is ttyS3 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart7priv /* LPUART7 is ttyS3 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart8priv /* LPUART8 is ttyS3 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart9priv /* LPUART9 is ttyS3 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart10priv /* LPUART10 is ttyS3 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart11priv /* LPUART11 is ttyS3 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart12priv /* LPUART12 is ttyS3 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS2_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys3/ttys4. This could be one of UART4-8. */

#if defined(CONFIG_IMXRT_LPUART4) && !defined(LPUART4_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart4priv /* LPUART4 is ttyS4 */
#    define LPUART4_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart4priv
#    define LPUART4_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART5) && !defined(LPUART5_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart5priv /* LPUART5 is ttyS4 */
#    define LPUART5_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart5priv
#    define LPUART5_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart6priv /* LPUART6 is ttyS4 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart7priv /* LPUART7 is ttyS4 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart8priv /* LPUART8 is ttyS4 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart9priv /* LPUART9 is ttyS4 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart10priv /* LPUART10 is ttyS4 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart11priv /* LPUART11 is ttyS4 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart12priv /* LPUART12 is ttyS4 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS3_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys4/ttys5. This could be one of UART5-12. */

#if defined(CONFIG_IMXRT_LPUART5) && !defined(LPUART5_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart5priv /* LPUART5 is ttyS5 */
#    define LPUART5_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart5priv
#    define LPUART5_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart6priv /* LPUART6 is ttyS5 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart7priv /* LPUART7 is ttyS5 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart8priv /* LPUART8 is ttyS5 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart9priv /* LPUART9 is ttyS5 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart10priv /* LPUART10 is ttyS5 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart11priv /* LPUART11 is ttyS5 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart12priv /* LPUART12 is ttyS5 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS4_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys5/ttys6. This could be one of UART6-12. */

#if defined(CONFIG_IMXRT_LPUART6) && !defined(LPUART6_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart6priv /* LPUART6 is ttyS6 */
#    define LPUART6_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart6priv
#    define LPUART6_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart7priv /* LPUART7 is ttyS6 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart8priv /* LPUART8 is ttyS6 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart9priv /* LPUART9 is ttyS6 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart10priv /* LPUART10 is ttyS6 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart11priv /* LPUART11 is ttyS6 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart12priv /* LPUART12 is ttyS6 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS5_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys6/ttys7. This could be one of UART7-12. */

#if defined(CONFIG_IMXRT_LPUART7) && !defined(LPUART7_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart7priv /* LPUART7 is ttyS7 */
#    define LPUART7_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart7priv
#    define LPUART7_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart8priv /* LPUART8 is ttyS7 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart9priv /* LPUART9 is ttyS7 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart10priv /* LPUART10 is ttyS7 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart11priv /* LPUART11 is ttyS7 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart12priv /* LPUART12 is ttyS7 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS6_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

