apache/nuttx/arch/arm/src/imxrt/imxrt_serial.c
/* Pick ttys7/ttys8. This could be one of UART8-12. */

#if defined(CONFIG_IMXRT_LPUART8) && !defined(LPUART8_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart8priv /* LPUART8 is ttyS8 */
#    define LPUART8_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart8priv
#    define LPUART8_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart9priv /* LPUART9 is ttyS8 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart10priv /* LPUART10 is ttyS8 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart11priv /* LPUART11 is ttyS8 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart12priv /* LPUART12 is ttyS8 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS7_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys8/ttys9. This could be one of UART9-12. */

#if defined(CONFIG_IMXRT_LPUART9) && !defined(LPUART9_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart9priv /* LPUART9 is ttyS9 */
#    define LPUART9_ASSIGNED    1
#  elif !defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart9priv
#    define LPUART9_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart10priv /* LPUART10 is ttyS9 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart11priv /* LPUART11 is ttyS9 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart12priv /* LPUART12 is ttyS9 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS8_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys9/ttys10. This could be one of UART10-12. */

#if defined(CONFIG_IMXRT_LPUART10) && !defined(LPUART10_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS10_DEV          g_lpuart10priv /* LPUART10 is ttyS10 */
#    define LPUART10_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart10priv
#    define LPUART10_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS10_DEV          g_lpuart11priv /* LPUART11 is ttyS10 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS10_DEV          g_lpuart12priv /* LPUART12 is ttyS10 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS9_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* Pick ttys10/ttys11. This could be one of UART11-12. */

#if defined(CONFIG_IMXRT_LPUART11) && !defined(LPUART11_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS11_DEV          g_lpuart11priv /* LPUART11 is ttyS11 */
#    define LPUART11_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS10_DEV           g_lpuart11priv
#    define LPUART11_ASSIGNED    1
#  endif
#elif defined(CONFIG_IMXRT_LPUART12) && !defined(LPUART12_ASSIGNED)
#  if defined(CONSOLE_DEV)
#    define TTYS11_DEV          g_lpuart12priv /* LPUART12 is ttyS11 */
#    define LPUART12_ASSIGNED   1
#  elif !defined(CONSOLE_DEV)
#    define TTYS10_DEV           g_lpuart12priv
#    define LPUART12_ASSIGNED    1
#  endif
#endif

/* UART, if available, should have been assigned to ttyS0-7. */

/* Power management definitions */

#if defined(CONFIG_PM) && !defined(CONFIG_IMXRT_PM_SERIAL_ACTIVITY)
#  define CONFIG_IMXRT_PM_SERIAL_ACTIVITY 10
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct imxrt_uart_s
{
  struct uart_dev_s dev;    /* Generic UART device */
  uint32_t uartbase;        /* Base address of UART registers */
  uint32_t baud;            /* Configured baud */
  spinlock_t lock;          /* Spinlock */
  uint32_t ie;              /* Saved enabled interrupts */
  uint8_t  irq;             /* IRQ associated with this UART */
  uint8_t  parity;          /* 0=none, 1=odd, 2=even */
  uint8_t  bits;            /* Number of bits (7 or 8) */
#if defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)
  uint8_t  inviflow:1;      /* Invert RTS sense */
  const uint32_t rts_gpio;  /* LPUART RTS GPIO pin configuration */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t cts_gpio;  /* LPUART CTS GPIO pin configuration */
#endif
#ifdef CONFIG_IMXRT_LPUART_SINGLEWIRE
  const uint32_t tx_gpio;   /* TX GPIO pin configuration */
  const struct uart_ops_s *prev_ops;
#endif

  uint8_t  stopbits2:1;     /* 1: Configure with 2 stop bits vs 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  uint8_t  iflow:1;         /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  uint8_t  oflow:1;         /* output flow control (CTS) enabled */
#endif
#ifdef CONFIG_SERIAL_RS485CONTROL
  uint8_t rs485mode:1;      /* We are in RS485 (RTS on TX) mode */
#endif
  /* TX DMA state */

