apache/nuttx/arch/arm/src/imxrt/imxrt_serial.c
      if ((usr & LPUART_STAT_NF) != 0)
        {
          imxrt_serialout(priv, IMXRT_LPUART_STAT_OFFSET,
                          lsr | LPUART_STAT_NF);
        }

      if ((usr & LPUART_STAT_PF) != 0)
        {
          imxrt_serialout(priv, IMXRT_LPUART_STAT_OFFSET,
                          lsr | LPUART_STAT_PF);
        }

      if ((usr & LPUART_STAT_FE) != 0)
        {
          imxrt_serialout(priv, IMXRT_LPUART_STAT_OFFSET,
                          lsr | LPUART_STAT_FE);
        }

      if ((usr & (LPUART_STAT_FE | LPUART_STAT_PF | LPUART_STAT_NF)) != 0)
        {
          /* Discard data */

          imxrt_serialin(priv, IMXRT_LPUART_DATA_OFFSET);
        }

#ifdef SERIAL_HAVE_RXDMA
      /* The line going to idle, deliver any fractions of RX data */

      if ((usr & LPUART_STAT_IDLE) != 0)
        {
          imxrt_serialout(priv, IMXRT_LPUART_STAT_OFFSET,
                          lsr | LPUART_STAT_IDLE);
          imxrt_dma_rxcallback(priv->rxdma, priv, false, LPUART_STAT_IDLE);
        }
#endif

      /* Handle incoming, receive bytes */

      if ((usr & LPUART_STAT_RDRF) != 0 &&
          (priv->ie & LPUART_CTRL_RIE) != 0)
        {
          uart_recvchars(&priv->dev);
          handled = true;
        }

      /* Handle outgoing, transmit bytes */

      if ((usr & LPUART_STAT_TDRE) != 0 &&
          (priv->ie & LPUART_CTRL_TIE) != 0)
        {
          uart_xmitchars(&priv->dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: imxrt_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int imxrt_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TIOCSERGSTRUCT)    || \
    defined(CONFIG_SERIAL_TERMIOS)           || \
    defined(CONFIG_IMXRT_LPUART_SINGLEWIRE ) || \
    defined(CONFIG_IMXRT_LPUART_INVERT )
  struct inode *inode = filep->f_inode;
  struct uart_dev_s *dev = inode->i_private;
  irqstate_t flags;
#endif
  int ret   = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
      case TIOCSERGSTRUCT:
        {
          struct imxrt_uart_s *user = (struct imxrt_uart_s *)arg;

          if (!user)
            {
              ret = -EINVAL;
            }
          else
            {
              memcpy(user, dev, sizeof(struct imxrt_uart_s));
            }
        }
        break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
      case TCGETS:
        {
          struct termios *termiosp = (struct termios *)arg;
          struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;

          if (!termiosp)
            {
              ret = -EINVAL;
              break;
            }

          /* Return parity */

          termiosp->c_cflag = ((priv->parity != 0) ? PARENB : 0) |
                              ((priv->parity == 1) ? PARODD : 0);

          /* Return stop bits */

          termiosp->c_cflag |= (priv->stopbits2) ? CSTOPB : 0;

          /* Return flow control */

#ifdef CONFIG_SERIAL_OFLOWCONTROL
          termiosp->c_cflag |= ((priv->oflow) ? CCTS_OFLOW : 0);
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          termiosp->c_cflag |= ((priv->iflow) ? CRTS_IFLOW : 0);
#endif
          /* Return baud */

          cfsetispeed(termiosp, priv->baud);

          /* Return number of bits */

          switch (priv->bits)
            {
              case 5:
                termiosp->c_cflag |= CS5;
                break;

              case 6:
                termiosp->c_cflag |= CS6;
                break;

              case 7:
                termiosp->c_cflag |= CS7;
                break;

              default:
              case 8:
                termiosp->c_cflag |= CS8;
                break;

#if defined(CS9)
              case 9:
                termiosp->c_cflag |= CS9;
                break;
#endif
            }
        }
        break;

      case TCSETS:
        {
          struct termios *termiosp = (struct termios *)arg;
          struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;
          uint32_t baud;
          uint32_t ie;
          uint8_t parity;
          uint8_t nbits;
          bool stop2;

          if ((!termiosp)
#ifdef CONFIG_SERIAL_OFLOWCONTROL
              || ((termiosp->c_cflag & CCTS_OFLOW) && (priv->cts_gpio == 0))
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
              || ((termiosp->c_cflag & CRTS_IFLOW) && (priv->rts_gpio == 0))
#endif
              )
            {
              ret = -EINVAL;
              break;
            }

          /* Decode baud. */

          ret = OK;
          baud = cfgetispeed(termiosp);

          /* Decode number of bits */

          switch (termiosp->c_cflag & CSIZE)
            {
              case CS5:
                nbits = 5;
                break;

              case CS6:
                nbits = 6;
                break;

              case CS7:
                nbits = 7;
                break;

              case CS8:
                nbits = 8;
                break;

#if defined(CS9)
              case CS9:
                nbits = 9;
                break;
#endif
              default:
                ret = -EINVAL;
                break;
            }

          /* Decode parity */

          if ((termiosp->c_cflag & PARENB) != 0)
            {
              parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
            }
          else
            {
              parity = 0;
            }

          /* Decode stop bits */

          stop2 = (termiosp->c_cflag & CSTOPB) != 0;

          /* Verify that all settings are valid before committing */

          if (ret == OK)
            {
              /* Commit */

              priv->baud      = baud;
              priv->parity    = parity;
              priv->bits      = nbits;
              priv->stopbits2 = stop2;
#ifdef CONFIG_SERIAL_OFLOWCONTROL
              priv->oflow     = (termiosp->c_cflag & CCTS_OFLOW) != 0;
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
              priv->iflow     = (termiosp->c_cflag & CRTS_IFLOW) != 0;
#endif
              /* effect the changes immediately - note that we do not
               * implement TCSADRAIN / TCSAFLUSH
               */

              flags  = spin_lock_irqsave(&priv->lock);
              imxrt_disableuartint(priv, &ie);
              ret = dev->ops->setup(dev);

