apache/nuttx/arch/arm/src/imxrt/imxrt_serial.c
              /* Restore the interrupt state */

              imxrt_restoreuartint(priv, ie);
              priv->ie = ie;
              spin_unlock_irqrestore(&priv->lock, flags);
            }
        }
        break;
#endif /* CONFIG_SERIAL_TERMIOS */

#ifdef CONFIG_IMXRT_LPUART_SINGLEWIRE
      case TIOCSSINGLEWIRE:
        {
          uint32_t regval;
          struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;

          flags  = spin_lock_irqsave(&priv->lock);
          regval = imxrt_serialin(priv, IMXRT_LPUART_CTRL_OFFSET);

          if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
            {
              uint32_t gpio_val;

              gpio_val = (arg & SER_SINGLEWIRE_PUSHPULL) ==
                         SER_SINGLEWIRE_PUSHPULL ?
                         IOMUX_CMOS_OUTPUT : IOMUX_OPENDRAIN;
              gpio_val |= (arg & SER_SINGLEWIRE_PULL_MASK) ==
                          SER_SINGLEWIRE_PULLUP ?
                          IOMUX_PULL_UP : IOMUX_PULL_NONE;
              gpio_val |= (arg & SER_SINGLEWIRE_PULL_MASK) ==
                          SER_SINGLEWIRE_PULLDOWN ?
                          IOMUX_PULL_DOWN : IOMUX_PULL_NONE;
              imxrt_config_gpio((priv->tx_gpio &
                                 ~(IOMUX_PULL_MASK | IOMUX_OPENDRAIN)) |
                                gpio_val);
              regval |= LPUART_CTRL_LOOPS | LPUART_CTRL_RSRC;
              priv->prev_ops = priv->dev.ops;
#ifdef SERIAL_HAVE_RXDMA
              if (priv->dev.ops->receive == imxrt_dma_receive)
                {
                  priv->dev.ops = &g_lpuart_singlewire_rxdma_ops;
                }
              else
#endif
                {
                  priv->dev.ops = &g_lpuart_singlewire_ops;
                }
            }
          else
            {
              imxrt_config_gpio((priv->tx_gpio &
                                 ~(IOMUX_PULL_MASK | IOMUX_OPENDRAIN)) |
                                IOMUX_PULL_NONE);
              regval &= ~(LPUART_CTRL_LOOPS | LPUART_CTRL_RSRC);
              if (priv->prev_ops)
                {
                  priv->dev.ops = priv->prev_ops;
                  priv->prev_ops = 0;
                }
            }

          imxrt_serialout(priv, IMXRT_LPUART_CTRL_OFFSET, regval);

          spin_unlock_irqrestore(&priv->lock, flags);
        }
        break;
#endif

#ifdef CONFIG_IMXRT_LPUART_INVERT
      case TIOCSINVERT:
        {
          uint32_t ctrl;
          uint32_t stat;
          uint32_t regval;
          struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;

          flags  = spin_lock_irqsave(&priv->lock);
          ctrl   = imxrt_serialin(priv, IMXRT_LPUART_CTRL_OFFSET);
          stat   = imxrt_serialin(priv, IMXRT_LPUART_STAT_OFFSET);
          regval = ctrl;

          /* {R|T}XINV bit field can only be written when the receiver
           * is disabled (RE=0).
           */

          regval &= ~LPUART_CTRL_RE;

          imxrt_serialout(priv, IMXRT_LPUART_CTRL_OFFSET, regval);

          /* Enable/disable signal inversion. */

          if (arg & SER_INVERT_ENABLED_RX)
            {
              stat |= LPUART_STAT_RXINV;
            }
          else
            {
              stat &= ~LPUART_STAT_RXINV;
            }

          if (arg & SER_INVERT_ENABLED_TX)
            {
              ctrl |= LPUART_CTRL_TXINV;
            }
          else
            {
              ctrl &= ~LPUART_CTRL_TXINV;
            }

          imxrt_serialout(priv, IMXRT_LPUART_STAT_OFFSET, stat);
          imxrt_serialout(priv, IMXRT_LPUART_CTRL_OFFSET, ctrl);

          spin_unlock_irqrestore(&priv->lock, flags);
        }
        break;
#endif

      case TIOCSBRK:  /* BSD compatibility: Turn break on, unconditionally */
      case TIOCCBRK:  /* BSD compatibility: Turn break off, unconditionally */
      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: imxrt_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the UART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_RXDMA
static int imxrt_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;
  uint32_t rxd;

  rxd     = imxrt_serialin(priv, IMXRT_LPUART_DATA_OFFSET);
  *status = rxd >> LPUART_DATA_STATUS_SHIFT;
  return (rxd & LPUART_DATA_MASK) >> LPUART_DATA_SHIFT;
}
#endif

/****************************************************************************
 * Name: imxrt_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_RXDMA
static void imxrt_rxint(struct uart_dev_s *dev, bool enable)
{
  struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;
  irqstate_t flags;
  uint32_t regval;

  /* Enable interrupts for data available at Rx */

  flags = spin_lock_irqsave(&priv->lock);
  if (enable)
    {
#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      priv->ie |= LPUART_CTRL_RIE | LPUART_CTRL_FEIE | LPUART_CTRL_ORIE;
#endif
    }
  else
    {
      priv->ie &= ~(LPUART_CTRL_RIE | LPUART_CTRL_FEIE | LPUART_CTRL_ORIE);
    }

  regval  = imxrt_serialin(priv, IMXRT_LPUART_CTRL_OFFSET);
  regval &= ~LPUART_ALL_INTS;
  regval |= priv->ie;
  imxrt_serialout(priv, IMXRT_LPUART_CTRL_OFFSET, regval);
  spin_unlock_irqrestore(&priv->lock, flags);
}
#endif

/****************************************************************************
 * Name: imxrt_rxavailable
 *
 * Description:
 *   Return true if the receive fifo is not empty
 *
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_RXDMA
static bool imxrt_rxavailable(struct uart_dev_s *dev)
{
  struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;
  uint32_t regval;

  /* Return true is data is ready in the Rx FIFO */

  regval = imxrt_serialin(priv, IMXRT_LPUART_STAT_OFFSET);
  return ((regval & LPUART_STAT_RDRF) != 0);
}
#endif

/****************************************************************************
 * Name: imxrt_rxflowcontrol
 *
 * Description:
 *   Called when Rx buffer is full (or exceeds configured watermark levels
 *   if CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS is defined).
 *   Return true if UART activated RX flow control to block more incoming
 *   data
 *
 * Input Parameters:
 *   dev       - UART device instance
 *   nbuffered - the number of characters currently buffered
 *               (if CONFIG_SERIAL_IFLOWCONTROL_WATERMARKS is
 *               not defined the value will be 0 for an empty buffer or the
 *               defined buffer size for a full buffer)
 *   upper     - true indicates the upper watermark was crossed where
 *               false indicates the lower watermark has been crossed
 *
 * Returned Value:
 *   true if RX flow control activated.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool imxrt_rxflowcontrol(struct uart_dev_s *dev,
                             unsigned int nbuffered, bool upper)
{
  struct imxrt_uart_s *priv = (struct imxrt_uart_s *)dev;
  bool use_swhs = false;

